leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
#include "esp_camera.h"
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <ArduinoOTA.h>
#include <Update.h>
#include <HTTPClient.h>
#include <ESPmDNS.h>
#include <DNSServer.h>
#include <stdarg.h>
#include <esp_arduino_version.h>

#ifndef pin_sccb_sda
#define pin_sccb_sda pin_sscb_sda
#endif

#ifndef pin_sccb_scl
#define pin_sccb_scl pin_sscb_scl
#endif

/*
  FORTIROOM ESP32-CAM Wireless Capture Server

  Features:
  - Wi-Fi auto-connect using saved credentials in NVS
  - AP fallback + captive-style configuration portal
  - ArduinoOTA support for Arduino IDE network upload
  - Web OTA upload page at /update
  - Telnet logging on port 23
  - Web log viewer at /logs
  - Existing camera endpoints preserved:
      GET /capture
      GET /button
      GET /trigger-capture
      GET /health
      GET /
*/

#define TRIGGER_PIN 3
#define FLASH_LED_PIN 4
#define FLASH_LED_PWM_CHANNEL 7
#define FLASH_LED_PWM_FREQ 5000
#define FLASH_LED_PWM_RESOLUTION 8
#define FLASH_LED_BRIGHTNESS 108

const unsigned long TRIGGER_DEBOUNCE_MS = 250;
const unsigned long TRIGGER_COOLDOWN_MS = 1200;
const unsigned long PORTAL_BLINK_INTERVAL_MS = 2000;
const char* AP_SSID = "FORTIROOM-CAM-Setup";
const char* AP_PASS = "";
const byte DNS_PORT = 53;
const unsigned long WIFI_CONNECT_TIMEOUT_MS = 20000;
const char* PREF_NAMESPACE = "fortiroom";
const bool USE_HARDCODED_WIFI = true;
const char* HARDCODED_WIFI_SSID = "Guest@HELP";
const char* HARDCODED_WIFI_PASS = "guEST@HELP";
const uint16_t TELNET_PORT = 23;
const size_t TELNET_CLIENT_SLOTS = 2;
const size_t LOG_BUFFER_LINES = 120;
const size_t WIFI_SCAN_CACHE_LIMIT = 20;
// Change this when your XAMPP/laptop IP changes.
// Example: http://10.150.211.78/Fortiroom
const char* DEFAULT_SERVER_BASE_URL = "http://10.150.215.215/Fortiroom";
const char* CAMERA_REGISTRY_PATH = "/esp32_cam_registry.php";
const char* FACE_VERIFY_PATH = "/face_verify_api.php";
const char* CAMERA_DEVICE_ID = "fortiroom-cam";
const unsigned long CAMERA_REGISTRY_REPORT_INTERVAL_MS = 60000;
const unsigned long CAMERA_REGISTRY_RETRY_INTERVAL_MS = 15000;
const unsigned long VERIFY_TIMEOUT_MS = 20000;

WebServer server(80);
WiFiServer telnetServer(TELNET_PORT);
WiFiClient telnetClients[TELNET_CLIENT_SLOTS];
Preferences prefs;
DNSServer dnsServer;

bool portalMode = false;
bool wifiReady = false;
String deviceHostname = "fortiroom-cam";
String savedServerBase = "";
unsigned long lastPortalBlinkMs = 0;
unsigned long lastCameraRegistryReportMs = 0;
bool lastCameraRegistryReportOk = false;
String cachedSsids[WIFI_SCAN_CACHE_LIMIT];
int32_t cachedRssis[WIFI_SCAN_CACHE_LIMIT];
size_t cachedNetworkCount = 0;
unsigned long cachedNetworkScanMs = 0;
bool wifiScanInProgress = false;

bool lastTriggerState = HIGH;
unsigned long lastTriggerMs = 0;
volatile bool buttonTriggerPending = false;
volatile unsigned long buttonTriggerAtMs = 0;
uint8_t *triggerJpeg = NULL;
size_t triggerJpegLen = 0;
unsigned long triggerCaptureSeq = 0;

String logBuffer[LOG_BUFFER_LINES];
size_t logWriteIndex = 0;
size_t logStoredCount = 0;

struct DeviceConfig {
  String ssid;
  String password;
};

DeviceConfig deviceConfig;

#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27

#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22

static String buildStatusHtml();

static String htmlEscape(const String &value) {
  String out = value;
  out.replace("&", "&amp;");
  out.replace("<", "&lt;");
  out.replace(">", "&gt;");
  out.replace("\"", "&quot;");
  out.replace("'", "&#39;");
  return out;
}

static String jsonEscape(const String &value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    char c = value.charAt(i);
    switch (c) {
      case '\\': out += "\\\\"; break;
      case '"': out += "\\\""; break;
      case '\n': out += "\\n"; break;
      case '\r': out += "\\r"; break;
      case '\t': out += "\\t"; break;
      default: out += c; break;
    }
  }
  return out;
}

static String base64Encode(const uint8_t *data, size_t len) {
  static const char table[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  String out;
  out.reserve(((len + 2) / 3) * 4);

  for (size_t i = 0; i < len; i += 3) {
    uint32_t octetA = data[i];
    uint32_t octetB = (i + 1 < len) ? data[i + 1] : 0;
    uint32_t octetC = (i + 2 < len) ? data[i + 2] : 0;
    uint32_t triple = (octetA << 16) | (octetB << 8) | octetC;

    out += table[(triple >> 18) & 0x3F];
    out += table[(triple >> 12) & 0x3F];
    out += (i + 1 < len) ? table[(triple >> 6) & 0x3F] : '=';
    out += (i + 2 < len) ? table[triple & 0x3F] : '=';
  }

  return out;
}

static String jsonExtractString(const String &json, const char *key, const String &fallback = "") {
  String needle = "\"" + String(key) + "\"";
  int pos = json.indexOf(needle);
  if (pos < 0) return fallback;
  int colon = json.indexOf(':', pos + needle.length());
  if (colon < 0) return fallback;
  int firstQuote = json.indexOf('"', colon + 1);
  if (firstQuote < 0) return fallback;

  String out;
  bool escaped = false;
  for (int i = firstQuote + 1; i < (int)json.length(); i++) {
    char c = json.charAt(i);
    if (escaped) {
      switch (c) {
        case 'n': out += '\n'; break;
        case 'r': out += '\r'; break;
        case 't': out += '\t'; break;
        default: out += c; break;
      }
      escaped = false;
      continue;
    }
    if (c == '\\') {
      escaped = true;
      continue;
    }
    if (c == '"') {
      return out;
    }
    out += c;
  }

  return fallback;
}

static bool jsonExtractBool(const String &json, const char *key, bool fallback) {
  String needle = "\"" + String(key) + "\"";
  int pos = json.indexOf(needle);
  if (pos < 0) return fallback;
  int colon = json.indexOf(':', pos + needle.length());
  if (colon < 0) return fallback;
  int start = colon + 1;
  while (start < (int)json.length() && (json.charAt(start) == ' ' || json.charAt(start) == '\t')) start++;
  if (json.startsWith("true", start)) return true;
  if (json.startsWith("false", start)) return false;
  return fallback;
}

