leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
static String jsonExtractNumberString(const String &json, const char *key, const String &fallback = "") {
  String needle = "\"" + String(key) + "\"";
  int pos = json.indexOf(needle);
  if (pos < 0) return fallback;
  int colon = json.indexOf(':', pos + needle.length());
  if (colon < 0) return fallback;
  int start = colon + 1;
  while (start < (int)json.length() && (json.charAt(start) == ' ' || json.charAt(start) == '\t')) start++;
  int end = start;
  while (end < (int)json.length()) {
    char c = json.charAt(end);
    if ((c >= '0' && c <= '9') || c == '.' || c == '-') {
      end++;
      continue;
    }
    break;
  }
  if (end <= start) return fallback;
  return json.substring(start, end);
}

static String urlEncode(const String &value) {
  const char *hex = "0123456789ABCDEF";
  String out;
  out.reserve(value.length() * 3);
  for (size_t i = 0; i < value.length(); i++) {
    unsigned char c = (unsigned char) value.charAt(i);
    if ((c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '-' || c == '_' || c == '.' || c == '~') {
      out += (char) c;
    } else if (c == ' ') {
      out += "%20";
    } else {
      out += '%';
      out += hex[(c >> 4) & 0x0F];
      out += hex[c & 0x0F];
    }
  }
  return out;
}

static String ipToString(const IPAddress &ip) {
  if (ip == IPAddress((uint32_t)0)) {
    return "";
  }
  return ip.toString();
}

static IPAddress parseIpOrZero(const String &raw) {
  IPAddress ip;
  if (ip.fromString(raw)) {
    return ip;
  }
  return IPAddress((uint32_t)0);
}

static void writeTelnet(const String &line) {
  for (size_t i = 0; i < TELNET_CLIENT_SLOTS; i++) {
    if (telnetClients[i] && telnetClients[i].connected()) {
      telnetClients[i].println(line);
    }
  }
}

static void pushLogLine(const String &line) {
  Serial.println(line);
  writeTelnet(line);
  logBuffer[logWriteIndex] = line;
  logWriteIndex = (logWriteIndex + 1) % LOG_BUFFER_LINES;
  if (logStoredCount < LOG_BUFFER_LINES) {
    logStoredCount++;
  }
}

static void logf(const char *fmt, ...) {
  char buffer[256];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buffer, sizeof(buffer), fmt, args);
  va_end(args);
  pushLogLine(String(buffer));
}

static void loadConfig() {
  prefs.begin(PREF_NAMESPACE, true);
  deviceConfig.ssid = prefs.getString("ssid", "");
  deviceConfig.password = prefs.getString("pass", "");
  prefs.end();
  deviceHostname = "fortiroom-cam";
  savedServerBase = "";
}

static void saveConfig(const DeviceConfig &config) {
  prefs.begin(PREF_NAMESPACE, false);
  prefs.putString("ssid", config.ssid);
  prefs.putString("pass", config.password);
  prefs.remove("host");
  prefs.remove("server");
  prefs.remove("useStatic");
  prefs.remove("ip");
  prefs.remove("gateway");
  prefs.remove("subnet");
  prefs.remove("dns");
  prefs.end();
}

static String normalizedServerBaseUrl(const String &raw) {
  String url = raw;
  url.trim();
  while (url.endsWith("/")) {
    url.remove(url.length() - 1);
  }
  return url;
}

static String getServerBaseUrl() {
  String configured = normalizedServerBaseUrl(savedServerBase);
  if (configured.length() > 0) {
    return configured;
  }
  String fallback = normalizedServerBaseUrl(String(DEFAULT_SERVER_BASE_URL));
  return fallback;
}

static String currentBaseUrl() {
  String host = portalMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
  return "http://" + host;
}

static void clearSavedWiFiConfig() {
  prefs.begin(PREF_NAMESPACE, false);
  prefs.remove("ssid");
  prefs.remove("pass");
  prefs.remove("host");
  prefs.remove("server");
  prefs.remove("useStatic");
  prefs.remove("ip");
  prefs.remove("gateway");
  prefs.remove("subnet");
  prefs.remove("dns");
  prefs.end();
}

static void addCorsHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

static void initFlashLed() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(FLASH_LED_PIN, FLASH_LED_PWM_FREQ, FLASH_LED_PWM_RESOLUTION);
#else
  ledcSetup(FLASH_LED_PWM_CHANNEL, FLASH_LED_PWM_FREQ, FLASH_LED_PWM_RESOLUTION);
  ledcAttachPin(FLASH_LED_PIN, FLASH_LED_PWM_CHANNEL);
#endif
}

static void setFlashLed(bool on) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(FLASH_LED_PIN, on ? FLASH_LED_BRIGHTNESS : 0);
#else
  ledcWrite(FLASH_LED_PWM_CHANNEL, on ? FLASH_LED_BRIGHTNESS : 0);
#endif
}

static void prepareFlashForCapture(uint8_t settleFrames = 3, uint16_t settleDelayMs = 80) {
  setFlashLed(true);
  delay(260);

  for (uint8_t i = 0; i < settleFrames; i++) {
    camera_fb_t *tmp = esp_camera_fb_get();
    if (tmp) {
      esp_camera_fb_return(tmp);
    }
    delay(settleDelayMs);
  }
}

static void finishFlashCapture() {
  setFlashLed(false);
}

static void blinkFlashStatus(uint8_t times, unsigned long onMs, unsigned long offMs) {
  for (uint8_t i = 0; i < times; i++) {
    setFlashLed(true);
    delay(onMs);
    setFlashLed(false);
    if (i + 1 < times) {
      delay(offMs);
    }
  }
}

static void blinkPortalWaitingPattern() {
  blinkFlashStatus(2, 80, 120);
}

static void blinkWifiConnectedPattern() {
  blinkFlashStatus(2, 40, 120);
}

static void completeCachedNetworksFromScan(int networkCount) {
  cachedNetworkCount = 0;
  if (networkCount <= 0) {
    WiFi.scanDelete();
    cachedNetworkScanMs = millis();
    wifiScanInProgress = false;
    logf("Wi-Fi scan complete. No networks found.");
    return;
  }

  for (int i = 0; i < networkCount && cachedNetworkCount < WIFI_SCAN_CACHE_LIMIT; i++) {
    String ssid = WiFi.SSID(i);
    if (ssid.length() == 0) {
      continue;
    }

    bool duplicate = false;
    for (size_t j = 0; j < cachedNetworkCount; j++) {
      if (cachedSsids[j] == ssid) {
        duplicate = true;
        if (WiFi.RSSI(i) > cachedRssis[j]) {
          cachedRssis[j] = WiFi.RSSI(i);
        }
        break;
      }
    }

    if (!duplicate) {
      cachedSsids[cachedNetworkCount] = ssid;
      cachedRssis[cachedNetworkCount] = WiFi.RSSI(i);
      cachedNetworkCount++;
    }
  }

