leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
  for (size_t i = 0; i < cachedNetworkCount; i++) {
    for (size_t j = i + 1; j < cachedNetworkCount; j++) {
      if (cachedRssis[j] > cachedRssis[i]) {
        String ssidTmp = cachedSsids[i];
        int32_t rssiTmp = cachedRssis[i];
        cachedSsids[i] = cachedSsids[j];
        cachedRssis[i] = cachedRssis[j];
        cachedSsids[j] = ssidTmp;
        cachedRssis[j] = rssiTmp;
      }
    }
  }

  WiFi.scanDelete();
  cachedNetworkScanMs = millis();
  wifiScanInProgress = false;
  logf("Wi-Fi scan complete. %u networks cached.", (unsigned int) cachedNetworkCount);
}

static void startAsyncNetworkScan() {
  if (wifiScanInProgress) {
    return;
  }
  WiFi.scanDelete();
  wifiScanInProgress = true;
  cachedNetworkCount = 0;
  WiFi.scanNetworks(true);
  logf("Wi-Fi scan started...");
}

static void pollAsyncNetworkScan() {
  if (!wifiScanInProgress) {
    return;
  }
  int networkCount = WiFi.scanComplete();
  if (networkCount == WIFI_SCAN_RUNNING) {
    return;
  }
  if (networkCount == WIFI_SCAN_FAILED) {
    wifiScanInProgress = false;
    logf("Wi-Fi scan failed.");
    return;
  }
  completeCachedNetworksFromScan(networkCount);
}

static void resetCameraPower() {
  pinMode(PWDN_GPIO_NUM, OUTPUT);
  digitalWrite(PWDN_GPIO_NUM, HIGH);
  delay(150);
  digitalWrite(PWDN_GPIO_NUM, LOW);
  delay(150);
}

static void flushCameraFrames(uint8_t count = 3, uint16_t delayMs = 80) {
  for (uint8_t i = 0; i < count; i++) {
    camera_fb_t *oldFrame = esp_camera_fb_get();
    if (oldFrame) {
      esp_camera_fb_return(oldFrame);
    }
    delay(delayMs);
  }
}

static void setCameraForPreview() {
  sensor_t *s = esp_camera_sensor_get();
  if (!s) return;

  if (psramFound()) {
    s->set_framesize(s, FRAMESIZE_VGA);
    s->set_quality(s, 5);
  } else {
    s->set_framesize(s, FRAMESIZE_QVGA);
    s->set_quality(s, 9);
  }
}

static void setCameraForStillCapture() {
  sensor_t *s = esp_camera_sensor_get();
  if (!s) return;
  bool isOv3660 = (s->id.PID == OV3660_PID);

  if (psramFound()) {
    s->set_framesize(s, FRAMESIZE_VGA);
    s->set_quality(s, 4);
  } else {
    s->set_framesize(s, FRAMESIZE_VGA);
    s->set_quality(s, 7);
  }

  // Use a brighter, cleaner still-photo profile than the live preview.
  // OV3660 often benefits from stronger exposure guidance indoors.
  s->set_brightness(s, 4);
  s->set_contrast(s, 1);
  s->set_saturation(s, 2);
  s->set_gainceiling(s, (gainceiling_t)8);
  s->set_gain_ctrl(s, 1);
  s->set_agc_gain(s, isOv3660 ? 14 : 12);
  s->set_exposure_ctrl(s, 1);
  s->set_aec2(s, 1);
  s->set_aec_value(s, isOv3660 ? 980 : 720);
  s->set_ae_level(s, isOv3660 ? 5 : 4);
  s->set_dcw(s, 1);
  s->set_denoise(s, 7);
  s->set_sharpness(s, 2);
}

static bool storeTriggeredCapture() {
  setCameraForStillCapture();
  prepareFlashForCapture(4, 90);

  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    finishFlashCapture();
    setCameraForPreview();
    return false;
  }

  uint8_t *copy = psramFound() ? (uint8_t *) ps_malloc(fb->len) : (uint8_t *) malloc(fb->len);
  if (!copy) {
    esp_camera_fb_return(fb);
    finishFlashCapture();
    setCameraForPreview();
    return false;
  }

  memcpy(copy, fb->buf, fb->len);
  size_t copyLen = fb->len;
  esp_camera_fb_return(fb);

  if (triggerJpeg) {
    free(triggerJpeg);
  }

  triggerJpeg = copy;
  triggerJpegLen = copyLen;
  triggerCaptureSeq++;

  finishFlashCapture();
  setCameraForPreview();
  flushCameraFrames(2, 60);

  return true;
}

static bool initCamera() {
  resetCameraPower();

  camera_config_t config;
  memset(&config, 0, sizeof(config));
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  if (psramFound()) {
    config.frame_size = FRAMESIZE_VGA;
    config.jpeg_quality = 5;
    config.fb_count = 1;
  } else {
    config.frame_size = FRAMESIZE_QVGA;
    config.jpeg_quality = 9;
    config.fb_count = 1;
  }

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    logf("Camera init failed with error 0x%x", err);
    return false;
  }

  sensor_t *s = esp_camera_sensor_get();
  if (s) {
    s->set_framesize(s, psramFound() ? FRAMESIZE_VGA : FRAMESIZE_QVGA);
    s->set_quality(s, psramFound() ? 5 : 9);

    // Indoor portrait tuning: keep the image brighter without crushing shadows
    // or letting auto-gain introduce too much visible grain.
    s->set_brightness(s, 3);
    s->set_contrast(s, 0);
    s->set_saturation(s, 0);

    s->set_gainceiling(s, (gainceiling_t)6);
    s->set_gain_ctrl(s, 1);
    s->set_agc_gain(s, 10);

    s->set_whitebal(s, 1);
    s->set_awb_gain(s, 1);
    s->set_wb_mode(s, 0);

    s->set_exposure_ctrl(s, 1);
    s->set_aec2(s, 1);
    s->set_ae_level(s, 3);

    s->set_raw_gma(s, 1);
    s->set_lenc(s, 1);
    s->set_hmirror(s, 1);
    s->set_vflip(s, 1);
    s->set_bpc(s, 1);
    s->set_wpc(s, 1);
    s->set_colorbar(s, 0);

    logf("Camera tuning applied: preview=%s still=%s brightness=3 contrast=0 ae_level=3 agc_gain=10 gainceiling=6 flash=%d",
         psramFound() ? "VGA" : "QVGA",
         psramFound() ? "VGA" : "VGA",
         FLASH_LED_BRIGHTNESS);
  }

  flushCameraFrames(4, 80);

  logf("Camera initialized. Profile: %s",
       psramFound() ? "VGA preview / VGA still capture with flash" : "QVGA preview / VGA still capture with flash");
  return true;
}

static void handleOptions() {
  addCorsHeaders();
  server.send(204);
}

static void sendRedirectRoot() {
  addCorsHeaders();
  String host = portalMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
  server.sendHeader("Location", "http://" + host + "/", true);
  server.send(302, "text/plain", "Redirecting...");
}

static void sendPortalPageDirect() {
  addCorsHeaders();
  server.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.send(200, "text/html", buildStatusHtml());
}

