leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
static String buildStatusHtml() {
  String html;
  html += "<!doctype html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>FORTIROOM ESP32-CAM</title>";
  html += "<style>";
  html += "body{font-family:Arial,sans-serif;background:#10161d;color:#eef2f7;margin:0;padding:24px}";
  html += "h1{margin-top:0}a{color:#7fd4ff}";
  html += "section{background:#18212b;border-radius:16px;padding:18px;margin-bottom:16px}";
  html += "input,button{width:100%;box-sizing:border-box;padding:12px;margin:6px 0 12px;border-radius:10px;border:1px solid #425468}";
  html += "input{background:#0f1720;color:#fff}";
  html += "button{background:#17a34a;color:#fff;font-weight:bold;border:0;cursor:pointer}";
  html += ".danger{background:#c0392b}.mono{font-family:Consolas,monospace}";
  html += ".grid{display:grid;gap:16px;grid-template-columns:repeat(auto-fit,minmax(280px,1fr))}";
  html += "</style>";
  html += "</head><body><h1>FORTIROOM ESP32-CAM</h1>";

  html += "<section><strong>Mode:</strong> ";
  html += portalMode ? "AP Configuration Portal" : "Wi-Fi Connected";
  html += "<br><strong>IP:</strong> <span class='mono'>" + htmlEscape(portalMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "</span>";
  if (!portalMode) {
    html += "<br><strong>SSID:</strong> " + htmlEscape(WiFi.SSID());
    html += "<br><strong>RSSI:</strong> " + String(WiFi.RSSI());
  }
  html += "</section>";

  if (portalMode) {
    html += "<section><h2>Connect to Wi-Fi</h2>";
    html += "<form method='post' action='/save-config'>";
    html += "<label>SSID</label><input name='ssid' value='" + htmlEscape(deviceConfig.ssid) + "' required>";
    html += "<label>Password</label><input name='password' type='password'>";
    html += "<button type='submit'>Save and Connect</button>";
    html += "</form></section>";
  } else {
    html += "<div class='grid'>";
    html += "<section><h2>Camera</h2>";
    html += "<div><a href='/capture' target='_blank'>Open /capture</a></div>";
    html += "<div><a href='/trigger-capture' target='_blank'>Open /trigger-capture</a></div>";
    html += "<div><a href='/button' target='_blank'>Open /button</a></div>";
    html += "<div><a href='/health' target='_blank'>Open /health</a></div>";
    html += "</section>";
    html += "<section><h2>Wireless Development</h2>";
    html += "<div><a href='/update'>Web OTA Update</a></div>";
    html += "<div><a href='/logs'>Live Logs</a></div>";
    html += "<div>Telnet: <code>" + htmlEscape(WiFi.localIP().toString()) + ":" + String(TELNET_PORT) + "</code></div>";
    html += "<div>ArduinoOTA Host: <code>" + htmlEscape(deviceHostname) + ".local</code></div>";
    html += "</section>";
    html += "<section><h2>Configuration</h2><form method='post' action='/save-config'>";
    html += "<label>SSID</label><input name='ssid' required value='" + htmlEscape(deviceConfig.ssid) + "'>";
    html += "<label>Password</label><input name='password' type='password' value='" + htmlEscape(deviceConfig.password) + "'>";
    html += "<button type='submit'>Save and Reboot</button></form></section>";
    html += "</div>";
  }

  html += "<section><h2>Actions</h2>";
  html += "<form method='post' action='/reset-wifi'><button class='danger' type='submit'>Reset Saved Wi-Fi</button></form>";
  html += "<p><a href='/health'>/health</a></p>";
  html += "</section>";
  html += "</body></html>";
  return html;
}

static String buildCountdownHtml(const String &title, const String &message, int seconds) {
  String html;
  html += "<!doctype html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>" + htmlEscape(title) + "</title>";
  html += "<style>body{font-family:Arial,sans-serif;background:#111;color:#f4f4f4;margin:0;padding:24px;display:flex;align-items:center;justify-content:center;min-height:100vh}section{background:#1b1b1b;border-radius:16px;padding:24px;max-width:520px;width:100%;text-align:center}h1{margin-top:0}.count{font-size:48px;font-weight:bold;color:#18a058;margin:16px 0}</style>";
  html += "</head><body><section>";
  html += "<h1>" + htmlEscape(title) + "</h1>";
  html += "<p>" + htmlEscape(message) + "</p>";
  html += "<div class='count' id='count'>" + String(seconds) + "</div>";
  html += "<script>let s=" + String(seconds) + ";const el=document.getElementById('count');const timer=setInterval(()=>{s--;if(s<=0){el.textContent='0';clearInterval(timer);}else{el.textContent=String(s);}},1000);</script>";
  html += "</section></body></html>";
  return html;
}

static void handleRoot() {
  addCorsHeaders();
  server.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.send(200, "text/html", buildStatusHtml());
}

static void handleCaptivePortalProbe() {
  if (portalMode) {
    sendPortalPageDirect();
    return;
  }
  handleRoot();
}

static void handleHealth() {
  addCorsHeaders();
  String json = "{";
  json += "\"status\":\"ok\",";
  json += "\"mode\":\"" + String(portalMode ? "ap" : "sta") + "\",";
  json += "\"hostname\":\"" + jsonEscape(deviceHostname) + "\",";
  json += "\"ip\":\"" + String(portalMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\",";
  json += "\"rssi\":" + String(wifiReady ? WiFi.RSSI() : 0) + ",";
  json += "\"psram\":" + String(psramFound() ? "true" : "false") + ",";
  json += "\"capture_seq\":" + String(triggerCaptureSeq);
  json += "}";
  server.send(200, "application/json", json);
}

static void handleLogsJson() {
  addCorsHeaders();
  String json = "{\"logs\":[";
  for (size_t i = 0; i < logStoredCount; i++) {
    size_t index = (logWriteIndex + LOG_BUFFER_LINES - logStoredCount + i) % LOG_BUFFER_LINES;
    if (i > 0) {
      json += ",";
    }
    json += "\"" + jsonEscape(logBuffer[index]) + "\"";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

static void handleNetworksJson() {
  addCorsHeaders();
  String json = "{";
  json += "\"scanning\":" + String(wifiScanInProgress ? "true" : "false") + ",";
  json += "\"last_scan_seconds\":";
  if (cachedNetworkScanMs == 0) {
    json += "-1,";
  } else {
    json += String((millis() - cachedNetworkScanMs) / 1000UL) + ",";
  }
  json += "\"networks\":[";
  for (size_t i = 0; i < cachedNetworkCount; i++) {
    if (i > 0) {
      json += ",";
    }
    json += "{\"ssid\":\"" + jsonEscape(cachedSsids[i]) + "\",\"rssi\":" + String(cachedRssis[i]) + "}";
  }
  json += "]}";
  server.send(200, "application/json", json);
}

