leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
static void handleLogsPage() {
  addCorsHeaders();
  String html;
  html += "<!doctype html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>FORTIROOM Logs</title>";
  html += "<style>body{font-family:Consolas,monospace;background:#0c1016;color:#d8f0ff;margin:0;padding:24px}pre{background:#111827;border-radius:12px;padding:16px;white-space:pre-wrap;word-break:break-word;min-height:300px}a{color:#7fd4ff}</style>";
  html += "</head><body><h1>Live Logs</h1><p><a href='/'>Back</a></p><pre id='log'>Loading...</pre>";
  html += "<script>async function refresh(){const r=await fetch('/logs.json',{cache:'no-store'});const j=await r.json();document.getElementById('log').textContent=(j.logs||[]).join('\\n');}refresh();setInterval(refresh,2000);</script>";
  html += "</body></html>";
  server.send(200, "text/html", html);
}

static void handleButtonTrigger() {
  addCorsHeaders();
  bool pressed = buttonTriggerPending;
  unsigned long pressedAt = buttonTriggerAtMs;
  buttonTriggerPending = false;
  String host = portalMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
  String json = "{";
  json += "\"pressed\":" + String(pressed ? "true" : "false") + ",";
  json += "\"pressed_at_ms\":" + String(pressedAt) + ",";
  json += "\"capture_seq\":" + String(triggerCaptureSeq) + ",";
  json += "\"ip\":\"" + host + "\",";
  json += "\"capture_url\":\"http://" + host + "/trigger-capture?seq=" + String(triggerCaptureSeq) + "\"";
  json += "}";
  server.send(200, "application/json", json);
}

static void handleVerifyBooking() {
  addCorsHeaders();

  if (portalMode || !wifiReady || WiFi.status() != WL_CONNECTED) {
    server.send(503, "application/json", "{\"success\":false,\"error\":\"Camera is not connected to Wi-Fi\"}");
    return;
  }

  String username = server.arg("username");
  username.trim();
  if (username.length() == 0) {
    String body = server.arg("plain");
    if (body.length() > 0) {
      username = jsonExtractString(body, "username", "");
      username.trim();
    }
  }

  if (username.length() == 0) {
    server.send(400, "application/json", "{\"success\":false,\"error\":\"Username is required\"}");
    return;
  }

  setCameraForStillCapture();
  prepareFlashForCapture(4, 90);
  camera_fb_t *fb = esp_camera_fb_get();
  finishFlashCapture();
  setCameraForPreview();
  flushCameraFrames(2, 60);

  if (!fb) {
    server.send(500, "application/json", "{\"success\":false,\"error\":\"Camera capture failed during verification\"}");
    return;
  }

  String captureDataUrl = "data:image/jpeg;base64," + base64Encode(fb->buf, fb->len);
  esp_camera_fb_return(fb);

  String serverBaseUrl = getServerBaseUrl();
  if (serverBaseUrl.length() == 0) {
    server.send(500, "application/json", "{\"success\":false,\"error\":\"Server base URL is not configured\"}");
    return;
  }

  String verifyEndpoint = serverBaseUrl + FACE_VERIFY_PATH;
  String payload = "{";
  payload += "\"username\":\"" + jsonEscape(username) + "\",";
  payload += "\"esp32_capture_url\":\"" + jsonEscape(currentBaseUrl() + "/capture") + "\",";
  payload += "\"capture_image_data\":\"" + jsonEscape(captureDataUrl) + "\"";
  payload += "}";

  WiFiClient client;
  HTTPClient http;
  http.setTimeout(VERIFY_TIMEOUT_MS);
  if (!http.begin(client, verifyEndpoint)) {
    server.send(500, "application/json", "{\"success\":false,\"error\":\"Failed to start verification HTTP client\"}");
    return;
  }

  http.addHeader("Content-Type", "application/json");
  int statusCode = http.POST(payload);
  String responseBody = http.getString();
  http.end();

  bool verified = jsonExtractBool(responseBody, "verified", false);
  String similarity = jsonExtractNumberString(responseBody, "similarity", "null");
  String threshold = jsonExtractNumberString(responseBody, "threshold", "null");
  String verifyAttempt = jsonExtractString(responseBody, "verify_attempt", "");

  logf(
    "Booking verification for '%s' -> %d | verified=%s similarity=%s threshold=%s attempt=%s",
    username.c_str(),
    statusCode,
    verified ? "true" : "false",
    similarity.c_str(),
    threshold.c_str(),
    verifyAttempt.length() > 0 ? verifyAttempt.c_str() : "-"
  );

  if (statusCode < 200 || statusCode >= 300) {
    String errorJson = "{";
    errorJson += "\"success\":false,";
    errorJson += "\"error\":\"Verification request failed\",";
    errorJson += "\"status_code\":" + String(statusCode) + ",";
    errorJson += "\"raw_response\":\"" + jsonEscape(responseBody) + "\"";
    errorJson += "}";
    server.send(statusCode > 0 ? statusCode : 502, "application/json", errorJson);
    return;
  }
  String compactJson = "{";
  compactJson += "\"success\":true,";
  compactJson += "\"verified\":" + String(verified ? "true" : "false") + ",";
  compactJson += "\"similarity\":";
  compactJson += (similarity.length() > 0 ? similarity : "null");
  compactJson += ",";
  compactJson += "\"threshold\":";
  compactJson += (threshold.length() > 0 ? threshold : "null");
  compactJson += ",";
  compactJson += "\"verify_attempt\":\"" + jsonEscape(verifyAttempt) + "\",";
  compactJson += "\"username\":\"" + jsonEscape(username) + "\"";
  compactJson += "}";

  server.send(200, "application/json", compactJson);
}

static void sendJpegBuffer(uint8_t *buffer, size_t len) {
  WiFiClient client = server.client();
  addCorsHeaders();
  server.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.setContentLength(len);
  server.send(200, "image/jpeg", "");
  const size_t chunkSize = 1024;
  size_t sent = 0;
  while (sent < len) {
    size_t remaining = len - sent;
    size_t toWrite = remaining < chunkSize ? remaining : chunkSize;
    size_t written = client.write(buffer + sent, toWrite);
    if (written == 0) {
      delay(1);
      continue;
    }
    sent += written;
  }
}

static void handleCapture() {
  setCameraForStillCapture();
  prepareFlashForCapture(4, 90);

