leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    finishFlashCapture();
    setCameraForPreview();
    addCorsHeaders();
    server.send(500, "application/json", "{\"error\":\"Camera capture failed\"}");
    return;
  }

  sendJpegBuffer(fb->buf, fb->len);
  esp_camera_fb_return(fb);

  finishFlashCapture();
  setCameraForPreview();
  flushCameraFrames(2, 60);
}

static void handleTriggerCapture() {
  if (!triggerJpeg || triggerJpegLen == 0) {
    addCorsHeaders();
    server.send(404, "application/json", "{\"error\":\"No physical-trigger capture is available yet\"}");
    return;
  }
  sendJpegBuffer(triggerJpeg, triggerJpegLen);
}

static void handleUpdatePage() {
  addCorsHeaders();
  String html;
  html += "<!doctype html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>FORTIROOM OTA Update</title>";
  html += "<style>body{font-family:Arial,sans-serif;background:#111;color:#f4f4f4;margin:0;padding:24px}section{background:#1b1b1b;border-radius:16px;padding:18px}input,button{padding:10px;border-radius:8px}button{border:0;background:#18a058;color:#fff;font-weight:bold}a{color:#7fd4ff}</style>";
  html += "</head><body><section><h1>Web OTA Update</h1><p><a href='/'>Back</a></p>";
  html += "<form method='POST' action='/update' enctype='multipart/form-data'>";
  html += "<input type='file' name='firmware' accept='.bin' required><br><br>";
  html += "<button type='submit'>Upload Firmware</button>";
  html += "</form></section></body></html>";
  server.send(200, "text/html", html);
}

static void handleUpdateFinished() {
  addCorsHeaders();
  bool success = !Update.hasError();
  server.send(200, "text/plain", success ? "Update successful. Rebooting..." : "Update failed.");
  delay(500);
  if (success) {
    logf("Web OTA update completed. Rebooting...");
    ESP.restart();
  } else {
    logf("Web OTA update failed.");
  }
}

static void handleUpdateUpload() {
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    logf("Web OTA upload started: %s", upload.filename.c_str());
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      Update.printError(Serial);
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      Update.printError(Serial);
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) {
      logf("Web OTA upload finished successfully: %u bytes", upload.totalSize);
    } else {
      Update.printError(Serial);
    }
  }
}

static void handleSaveConfig() {
  DeviceConfig updated;
  updated.ssid = server.arg("ssid");
  updated.password = server.arg("password");

  saveConfig(updated);
  addCorsHeaders();
  server.send(200, "text/html", buildCountdownHtml("Configuration saved", "Device will reboot in:", 2));
  logf("Configuration updated for SSID '%s'. Rebooting...", updated.ssid.c_str());
  delay(2000);
  ESP.restart();
}

static void handleResetWiFi() {
  clearSavedWiFiConfig();
  addCorsHeaders();
  server.send(200, "text/html", buildCountdownHtml("Saved Wi-Fi cleared", "Device will reboot into setup mode in:", 2));
  logf("Saved Wi-Fi configuration cleared. Rebooting to setup portal...");
  delay(2000);
  ESP.restart();
}

static void handleReboot() {
  addCorsHeaders();
  server.send(200, "text/html", buildCountdownHtml("Rebooting", "Device will reboot in:", 1));
  logf("Reboot requested from web interface.");
  delay(1000);
  ESP.restart();
}

static void registerRoutes() {
  server.on("/", HTTP_GET, handleRoot);
  server.on("/generate_204", HTTP_GET, handleCaptivePortalProbe);
  server.on("/gen_204", HTTP_GET, handleCaptivePortalProbe);
  server.on("/hotspot-detect.html", HTTP_GET, handleCaptivePortalProbe);
  server.on("/library/test/success.html", HTTP_GET, handleCaptivePortalProbe);
  server.on("/success.txt", HTTP_GET, handleCaptivePortalProbe);
  server.on("/canonical.html", HTTP_GET, handleCaptivePortalProbe);
  server.on("/connecttest.txt", HTTP_GET, handleCaptivePortalProbe);
  server.on("/ncsi.txt", HTTP_GET, handleCaptivePortalProbe);
  server.on("/fwlink", HTTP_GET, handleCaptivePortalProbe);
  server.on("/redirect", HTTP_GET, handleCaptivePortalProbe);
  server.on("/capture", HTTP_GET, handleCapture);
  server.on("/button", HTTP_GET, handleButtonTrigger);
  server.on("/trigger-capture", HTTP_GET, handleTriggerCapture);
  server.on("/verify-booking", HTTP_GET, handleVerifyBooking);
  server.on("/verify-booking", HTTP_POST, handleVerifyBooking);
  server.on("/health", HTTP_GET, handleHealth);
  server.on("/logs", HTTP_GET, handleLogsPage);
  server.on("/logs.json", HTTP_GET, handleLogsJson);
  server.on("/save-config", HTTP_POST, handleSaveConfig);
  server.on("/reset-wifi", HTTP_POST, handleResetWiFi);
  server.on("/reboot", HTTP_GET, handleReboot);
  server.on("/update", HTTP_GET, handleUpdatePage);
  server.on("/update", HTTP_POST, handleUpdateFinished, handleUpdateUpload);

  server.on("/generate_204", HTTP_OPTIONS, handleOptions);
  server.on("/gen_204", HTTP_OPTIONS, handleOptions);
  server.on("/hotspot-detect.html", HTTP_OPTIONS, handleOptions);
  server.on("/library/test/success.html", HTTP_OPTIONS, handleOptions);
  server.on("/success.txt", HTTP_OPTIONS, handleOptions);
  server.on("/canonical.html", HTTP_OPTIONS, handleOptions);
  server.on("/connecttest.txt", HTTP_OPTIONS, handleOptions);
  server.on("/ncsi.txt", HTTP_OPTIONS, handleOptions);
  server.on("/fwlink", HTTP_OPTIONS, handleOptions);
  server.on("/redirect", HTTP_OPTIONS, handleOptions);
  server.on("/capture", HTTP_OPTIONS, handleOptions);
  server.on("/button", HTTP_OPTIONS, handleOptions);
  server.on("/trigger-capture", HTTP_OPTIONS, handleOptions);
  server.on("/verify-booking", HTTP_OPTIONS, handleOptions);
  server.on("/health", HTTP_OPTIONS, handleOptions);
  server.on("/logs.json", HTTP_OPTIONS, handleOptions);
  server.on("/save-config", HTTP_OPTIONS, handleOptions);
  server.on("/reset-wifi", HTTP_OPTIONS, handleOptions);
  server.on("/update", HTTP_OPTIONS, handleOptions);

  server.onNotFound([]() {
    if (portalMode) {
      sendRedirectRoot();
      return;
    }
    addCorsHeaders();
    server.send(404, "application/json", "{\"error\":\"Not found\"}");
  });
}

