leshvinsk/Fortiroom/envcode/esp32_cam_capture_test/esp32_cam_capture_test.ino
static bool applyStaticIpIfNeeded() {
  return true;
}

static bool connectToSavedWiFi() {
  if (USE_HARDCODED_WIFI) {
    deviceConfig.ssid = HARDCODED_WIFI_SSID;
    deviceConfig.password = HARDCODED_WIFI_PASS;
  }

  if (deviceConfig.ssid.length() == 0) {
    logf("No saved Wi-Fi credentials found.");
    return false;
  }

  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);
  delay(200);
  applyStaticIpIfNeeded();
  logf("Connecting to Wi-Fi SSID '%s'...", deviceConfig.ssid.c_str());
  WiFi.begin(deviceConfig.ssid.c_str(), deviceConfig.password.c_str());

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - start) < WIFI_CONNECT_TIMEOUT_MS) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    logf("Wi-Fi connection failed.");
    return false;
  }

  wifiReady = true;
  portalMode = false;
  logf("Wi-Fi connected. IP: %s", WiFi.localIP().toString().c_str());
  blinkWifiConnectedPattern();
  return true;
}

static void startPortalMode() {
  portalMode = true;
  wifiReady = false;
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP(AP_SSID, AP_PASS);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  lastPortalBlinkMs = 0;
  logf("Config portal started. AP SSID: %s", AP_SSID);
  logf("Portal IP: %s", WiFi.softAPIP().toString().c_str());
}

static void reportCameraRegistration(bool force) {
  if (!wifiReady || portalMode || WiFi.status() != WL_CONNECTED) {
    return;
  }

  unsigned long now = millis();
  unsigned long minInterval = lastCameraRegistryReportOk
    ? CAMERA_REGISTRY_REPORT_INTERVAL_MS
    : CAMERA_REGISTRY_RETRY_INTERVAL_MS;

  if (!force && lastCameraRegistryReportMs != 0 && (now - lastCameraRegistryReportMs) < minInterval) {
    return;
  }

  String serverBaseUrl = getServerBaseUrl();
  if (serverBaseUrl.length() == 0) {
    lastCameraRegistryReportMs = now;
    lastCameraRegistryReportOk = false;
    if (!lastCameraRegistryReportOk) {
      logf("Camera registry skipped: browser-assisted registration mode (no PHP server base URL configured).");
    }
    return;
  }

  String localIp = WiFi.localIP().toString();
  String localBaseUrl = "http://" + localIp;
  String endpointUrl = serverBaseUrl + CAMERA_REGISTRY_PATH;
  String payload = "{";
  payload += "\"device_id\":\"" + jsonEscape(String(CAMERA_DEVICE_ID)) + "\",";
  payload += "\"device\":\"fortiroom-cam\",";
  payload += "\"hostname\":\"" + jsonEscape(deviceHostname) + "\",";
  payload += "\"ssid\":\"" + jsonEscape(WiFi.SSID()) + "\",";
  payload += "\"ip\":\"" + jsonEscape(localIp) + "\",";
  payload += "\"base_url\":\"" + jsonEscape(localBaseUrl) + "\",";
  payload += "\"capture_url\":\"" + jsonEscape(localBaseUrl + "/capture") + "\",";
  payload += "\"health_url\":\"" + jsonEscape(localBaseUrl + "/health") + "\",";
  payload += "\"button_url\":\"" + jsonEscape(localBaseUrl + "/button") + "\",";
  payload += "\"trigger_capture_url\":\"" + jsonEscape(localBaseUrl + "/trigger-capture") + "\",";
  payload += "\"mac\":\"" + jsonEscape(WiFi.macAddress()) + "\",";
  payload += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  payload += "\"reported_by\":\"esp32\"";
  payload += "}";

  WiFiClient client;
  HTTPClient http;
  http.setTimeout(5000);
  if (!http.begin(client, endpointUrl)) {
    logf("Camera registry failed to start HTTP client: %s", endpointUrl.c_str());
    lastCameraRegistryReportMs = now;
    lastCameraRegistryReportOk = false;
    return;
  }

  http.addHeader("Content-Type", "application/json");
  int statusCode = http.POST(payload);
  String responseBody = http.getString();
  http.end();

  lastCameraRegistryReportMs = now;
  lastCameraRegistryReportOk = statusCode >= 200 && statusCode < 300;

  if (lastCameraRegistryReportOk) {
    logf("Camera registry updated: %s -> %s", endpointUrl.c_str(), localBaseUrl.c_str());
  } else {
    logf("Camera registry update failed (%d): %s", statusCode, responseBody.c_str());
  }
}

static void beginOtaService() {
  if (!wifiReady) {
    return;
  }

  ArduinoOTA.setHostname(deviceHostname.c_str());
  ArduinoOTA.onStart([]() {
    logf("ArduinoOTA start");
  });
  ArduinoOTA.onEnd([]() {
    logf("ArduinoOTA end");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    static unsigned int lastPercent = 255;
    unsigned int percent = total == 0 ? 0 : (progress * 100U) / total;
    if (percent != lastPercent && percent % 10 == 0) {
      lastPercent = percent;
      logf("ArduinoOTA progress: %u%%", percent);
    }
  });
  ArduinoOTA.onError([](ota_error_t error) {
    logf("ArduinoOTA error: %u", (unsigned int) error);
  });
  ArduinoOTA.begin();
  logf("ArduinoOTA ready.");
}

static void beginTelnetServer() {
  telnetServer.begin();
  telnetServer.setNoDelay(true);
  logf("Telnet logging ready on port %u", TELNET_PORT);
}

static void handleTelnetClients() {
  if (telnetServer.hasClient()) {
    WiFiClient incoming = telnetServer.available();
    bool assigned = false;

    for (size_t i = 0; i < TELNET_CLIENT_SLOTS; i++) {
      if (!telnetClients[i] || !telnetClients[i].connected()) {
        if (telnetClients[i]) {
          telnetClients[i].stop();
        }
        telnetClients[i] = incoming;
        telnetClients[i].println("FORTIROOM ESP32-CAM Telnet log connected.");
        assigned = true;
        break;
      }
    }

    if (!assigned) {
      incoming.println("Telnet log full.");
      incoming.stop();
    }
  }

  for (size_t i = 0; i < TELNET_CLIENT_SLOTS; i++) {
    if (telnetClients[i] && !telnetClients[i].connected()) {
      telnetClients[i].stop();
    }
    while (telnetClients[i] && telnetClients[i].available()) {
      telnetClients[i].read();
    }
  }
}

void setup() {
  Serial.begin(115200);
  pinMode(TRIGGER_PIN, INPUT_PULLUP);
  initFlashLed();
  setFlashLed(false);
  delay(1000);
  Serial.println();
  pushLogLine("FORTIROOM ESP32-CAM booting...");
  pushLogLine("Initializing camera...");

  if (!initCamera()) {
    pushLogLine("Camera init failed. Check board model and camera pin mapping.");
    while (true) {
      delay(1000);
    }
  }

  loadConfig();
  registerRoutes();

  if (!connectToSavedWiFi()) {
    startPortalMode();
  }

  server.begin();
  pushLogLine("HTTP server started.");

  if (wifiReady) {
    beginOtaService();
    beginTelnetServer();
    logf("Capture URL: http://%s/capture", WiFi.localIP().toString().c_str());
    logf("Camera registry endpoint: %s%s", getServerBaseUrl().c_str(), CAMERA_REGISTRY_PATH);
    reportCameraRegistration(true);
  } else {
    logf("Portal URL: http://%s/", WiFi.softAPIP().toString().c_str());
  }
}

void loop() {
  server.handleClient();

  if (portalMode) {
    dnsServer.processNextRequest();
    unsigned long nowBlink = millis();
    if (lastPortalBlinkMs == 0 || (nowBlink - lastPortalBlinkMs) >= PORTAL_BLINK_INTERVAL_MS) {
      lastPortalBlinkMs = nowBlink;
      blinkPortalWaitingPattern();
    }
  } else if (wifiReady) {
    ArduinoOTA.handle();
    handleTelnetClients();
    reportCameraRegistration(false);
  }

  bool currentTriggerState = digitalRead(TRIGGER_PIN);
  unsigned long now = millis();

  if (lastTriggerState == HIGH &&
      currentTriggerState == LOW &&
      (now - lastTriggerMs) > TRIGGER_DEBOUNCE_MS &&
      (now - lastTriggerMs) > TRIGGER_COOLDOWN_MS) {
    lastTriggerMs = now;
    buttonTriggerAtMs = now;
    bool captured = storeTriggeredCapture();
    buttonTriggerPending = captured;
    pushLogLine(captured
      ? "Physical trigger pressed. Stored snapshot for browser verification."
      : "Physical trigger pressed, but snapshot capture failed.");
  }

  lastTriggerState = currentTriggerState;
}
